### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # azurerm_api_management_api.wallet will be created
  + resource "azurerm_api_management_api" "wallet" {
      + api_management_name   = "io-p-itn-platform-api-gateway-apim-01"
      + api_type              = (known after apply)
      + description           = "IT-Wallet REST APIs"
      + display_name          = "IT-Wallet"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "io-p-wallet-api"
      + path                  = "api/wallet"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-itn-common-rg-01"
      + revision              = "1"
      + service_url           = (known after apply)
      + subscription_required = false
      + version               = "v1"
      + version_set_id        = (known after apply)

      + subscription_key_parameter_names (known after apply)
    }

  # azurerm_api_management_api_operation.wallet_catchall will be created
  + resource "azurerm_api_management_api_operation" "wallet_catchall" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + api_name            = "io-p-wallet-api"
      + description         = "Forwards all requests to backend"
      + display_name        = "Wallet Catch All"
      + id                  = (known after apply)
      + method              = "*"
      + operation_id        = "wallet-catchall"
      + resource_group_name = "io-p-itn-common-rg-01"
      + url_template        = "/*"

      + request (known after apply)
    }

  # azurerm_api_management_api_operation_policy.wallet will be created
  + resource "azurerm_api_management_api_operation_policy" "wallet" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + api_name            = "io-p-wallet-api"
      + id                  = (known after apply)
      + operation_id        = (known after apply)
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <policies>
              <inbound>
                  <include-fragment fragment-id="io-wallet-app-session-fragment" />
                  <set-backend-service backend-id="psn-backend-01" />
              </inbound>
            </policies>
        EOT
    }

  # azurerm_api_management_api_version_set.wallet_v1 will be created
  + resource "azurerm_api_management_api_version_set" "wallet_v1" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + display_name        = "v1"
      + id                  = (known after apply)
      + name                = "wallet_v1"
      + resource_group_name = "io-p-itn-common-rg-01"
      + versioning_scheme   = "Segment"
    }

  # azurerm_api_management_policy_fragment.wallet_authentication will be created
  + resource "azurerm_api_management_policy_fragment" "wallet_authentication" {
      + api_management_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01"
      + format            = "xml"
      + id                = (known after apply)
      + name              = "io-wallet-app-session-fragment"
      + value             = <<-EOT
            <fragment>
            	<!-- Extract the token from the Authorization Header -->
            	<set-variable name="token" value="@{
                string[] values;
                return context.Request.Headers.TryGetValue("Authorization", out values) ? values.FirstOrDefault() : "";
              }" />
            	<!-- Check if the Authorization header is valid, if not return 401 Unauthorized -->
            	<choose>
            		<when condition="@(
                  string.IsNullOrEmpty((string)context.Variables["token"]) ||
                  !(((string)context.Variables["token"]).StartsWith("Bearer ", StringComparison.OrdinalIgnoreCase)) ||
                  string.IsNullOrWhiteSpace(((string)context.Variables["token"]).Substring(7))
                )">
            			<set-header name="Content-Type" exists-action="override">
            				<value>application/json</value>
            			</set-header>
            			<return-response>
            				<set-status code="401" reason="Unauthorized" />
            				<set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
            			</return-response>
            		</when>
            	</choose>
            	<!-- Call the session manager, pasing the bearer token, to get the user identity -->
            	<send-request mode="new" response-variable-name="introspectionResponse" timeout="10" ignore-error="false">
            		<set-url>https://io-p-weu-session-manager-app-03.azurewebsites.net/api/auth/v1/user-identity</set-url>
            		<set-method>GET</set-method>
            		<set-header name="Content-Type" exists-action="override">
            			<value>application/json</value>
            		</set-header>
            		<set-header name="Authorization" exists-action="override">
            			<value>@(((string)context.Variables["token"]))</value>
            		</set-header>
            	</send-request>
            	<choose>
            		<!-- If 200 return set the x-user header as the base64 of the response -->
            		<when condition="@(((IResponse)context.Variables["introspectionResponse"]).StatusCode == 200)">
            			<!-- Parse the introspectionResponse as a string -->
            			<set-variable name="userData" value="@(((IResponse)context.Variables["introspectionResponse"]).Body.As&lt;string&gt;())" />
            			<!-- Remove the Authorization Header -->
            			<set-header name="Authorization" exists-action="delete" />
            			<!-- Set the x-user header with the user data -->
            			<set-header name="x-user" exists-action="override">
            				<value>@(
                      Convert.ToBase64String(
                          System.Text.Encoding.UTF8.GetBytes(((string)context.Variables["userData"]))
                      )
                    )</value>
            			</set-header>
            		</when>
            		<when condition="@(((IResponse)context.Variables["introspectionResponse"]).StatusCode == 401)">
            			<return-response response-variable-name="introspectionErrorResponse">
            				<set-status code="401" reason="Unauthorized" />
            				<set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
            			</return-response>
            		</when>
            		<otherwise>
            			<set-header name="Content-Type" exists-action="override">
            				<value>application/json</value>
            			</set-header>
            			<return-response response-variable-name="introspectionErrorResponse">
            				<set-status code="500" reason="Internal Server Error" />
            				<set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
            			</return-response>
            		</otherwise>
            	</choose>
            </fragment>
        EOT
    }

  # azurerm_api_management_product.wallet will be created
  + resource "azurerm_api_management_product" "wallet" {
      + api_management_name   = "io-p-itn-platform-api-gateway-apim-01"
      + approval_required     = false
      + description           = "Product for IT-Wallet APIs"
      + display_name          = "IT WALLET"
      + id                    = (known after apply)
      + product_id            = "it-wallet"
      + published             = true
      + resource_group_name   = "io-p-itn-common-rg-01"
      + subscription_required = false
    }

  # azurerm_api_management_product_api.wallet will be created
  + resource "azurerm_api_management_product_api" "wallet" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + api_name            = "io-p-wallet-api"
      + id                  = (known after apply)
      + product_id          = "it-wallet"
      + resource_group_name = "io-p-itn-common-rg-01"
    }

  # module.function_apps.module.function_app_user.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                     = "[REDACTED]"
            # (72 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-p-itn-wallet-user-func-02"
        name                                           = "io-p-itn-wallet-user-func-02"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Wallet"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
            "ModuleVersion"                                  = "4.1.1"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
            "hidden-link: /app-insights-conn-string"         = "[REDACTED]"
            "hidden-link: /app-insights-instrumentation-key" = "[REDACTED]"
            "hidden-link: /app-insights-resource-id"         = "[REDACTED]"
        }
        # (33 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_user.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                     = "[REDACTED]"
            # (73 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-p-itn-wallet-user-func-02/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "4.1.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
          ~ health_check_eviction_time_in_min             = 0 -> 2
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_user_uat.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                     = "foo"
            # (72 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-u-itn-wallet-user-func-01"
        name                                           = "io-u-itn-wallet-user-func-01"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "4.1.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (33 unchanged attributes hidden)

      ~ sticky_settings {
          ~ app_setting_names       = [
              - "AzureFunctionsWebHost__hostid",
                "SLOT_TASK_HUBNAME",
                # (1 unchanged element hidden)
                "APPINSIGHTS_SAMPLING_PERCENTAGE",
              + "AzureFunctionsWebHost__hostid",
                "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage",
                # (2 unchanged elements hidden)
            ]
            # (1 unchanged attribute hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_user_uat.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                     = "foo"
            # (73 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-u-itn-wallet-user-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "4.1.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
          ~ health_check_eviction_time_in_min             = 0 -> 2
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 7 to add, 4 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.storage_accounts.azurerm_storage_queue.wallet-instance-creation-email-queue-01,
  on ../_modules/storage_accounts/storage_queue.tf line 3, in resource "azurerm_storage_queue" "wallet-instance-creation-email-queue-01":
   3:   storage_account_name = azurerm_storage_account.common.name

the `storage_account_name` property has been deprecated in favour of
`storage_account_id` and will be removed in version 5.0 of the Provider.

(and 3 more similar warnings elsewhere)
```

</details>
